using UnityEngine;
using System.Collections.Generic;

namespace TechC
{
    public static class AllCharacterHelper
    {
        /// <summary>
        /// 各文字を対応するPrefabに変換して処理
        /// </summary>
        public static void ProcessCommentText(string text, Transform parent, Color color)
        {
            float spacing = 1.2f;
            float xOffset = 0f;

            const float PLAYER_TOP_OFFSET = -5.3f;
            const float ROTATE_X_DEGREE = 90f;
            const float ROTATE_Y_DEGREE = 180f;
            const float ROTATE_Z_DEGREE = 180f;

            const float SCALE_MULTIPLIER = 2f;  // ここに倍率を定義


            foreach (char c in text)
            {
                var prefab = CommentFactory.I.GetChar(c.ToString());

                if (prefab != null)
                {
                    GameObject obj = GameObject.Instantiate(prefab, parent);

                    // 文字の向きを調節する
                    obj.transform.localRotation = Quaternion.Euler(
                        obj.transform.localEulerAngles.x + ROTATE_X_DEGREE,
                        obj.transform.localEulerAngles.y + ROTATE_Y_DEGREE,
                        obj.transform.localEulerAngles.z + ROTATE_Z_DEGREE
                    );

                    obj.transform.localScale = new Vector3(SCALE_MULTIPLIER, SCALE_MULTIPLIER, SCALE_MULTIPLIER);

                    // 位置設定
                    obj.transform.localPosition = new Vector3(xOffset, 0f, 0f);
                    xOffset += spacing;

                    // Y,Z座標調整
                    Vector3 pos = obj.transform.position;
                    pos.y = parent.position.y;
                    pos.z = PLAYER_TOP_OFFSET;
                    obj.transform.position = pos;

                    // マテリアル色変更
                    var meshRenderer = obj.GetComponent<MeshRenderer>();
                    if (meshRenderer != null)
                    {
                        meshRenderer.material.color = color;
                    }

                }
            }
        }


        
        private static readonly Dictionary<string, string> charToPrefabName;

        // 静的コンストラクタで辞書を初期化
        static AllCharacterHelper()
        {
            var entries = new (string, string)[]
            {
                   // ASCII文字・記号
    ( "!", "U0021" ), ( "\"", "U0022" ), ( "#", "U0023" ), ( "$", "U0024" ), ( "%", "U0025" ),
    ( "&", "U0026" ), ( "'", "U0027" ), ( "(", "U0028" ), ( ")", "U0029" ), ( "*", "U002A" ),
    ( "+", "U002B" ), ( ",", "U002C" ), ( "-", "U002D" ), ( ".", "U002E" ), ( "/", "U002F" ),
    ( "0", "U0030" ), ( "1", "U0031" ), ( "2", "U0032" ), ( "3", "U0033" ), ( "4", "U0034" ),
    ( "5", "U0035" ), ( "6", "U0036" ), ( "7", "U0037" ), ( "8", "U0038" ), ( "9", "U0039" ),
    ( ":", "U003A" ), ( ";", "U003B" ), ( "<", "U003C" ), ( "=", "U003D" ), ( ">", "U003E" ),
    ( "?", "U003F" ), ( "@", "U0040" ),
    
    // 英字大文字
    ( "A", "U0041" ), ( "B", "U0042" ), ( "C", "U0043" ), ( "D", "U0044" ), ( "E", "U0045" ),
    ( "F", "U0046" ), ( "G", "U0047" ), ( "H", "U0048" ), ( "I", "U0049" ), ( "J", "U004A" ),
    ( "K", "U004B" ), ( "L", "U004C" ), ( "M", "U004D" ), ( "N", "U004E" ), ( "O", "U004F" ),
    ( "P", "U0050" ), ( "Q", "U0051" ), ( "R", "U0052" ), ( "S", "U0053" ), ( "T", "U0054" ),
    ( "U", "U0055" ), ( "V", "U0056" ), ( "W", "U0057" ), ( "X", "U0058" ), ( "Y", "U0059" ),
    ( "Z", "U005A" ),
    
    // 記号
    ( "[", "U005B" ), ( "\\", "U005C" ), ( "]", "U005D" ), ( "^", "U005E" ), ( "_", "U005F" ),
    ( "`", "U0060" ),
    
    // 英字小文字
    ( "a", "U0061" ), ( "b", "U0062" ), ( "c", "U0063" ), ( "d", "U0064" ), ( "e", "U0065" ),
    ( "f", "U0066" ), ( "g", "U0067" ), ( "h", "U0068" ), ( "i", "U0069" ), ( "j", "U006A" ),
    ( "k", "U006B" ), ( "l", "U006C" ), ( "m", "U006D" ), ( "n", "U006E" ), ( "o", "U006F" ),
    ( "p", "U0070" ), ( "q", "U0071" ), ( "r", "U0072" ), ( "s", "U0073" ), ( "t", "U0074" ),
    ( "u", "U0075" ), ( "v", "U0076" ), ( "w", "U0077" ), ( "x", "U0078" ), ( "y", "U0079" ),
    ( "z", "U007A" ),
    
    // 記号
    ( "(", "U007B" ), ( "|", "U007C" ), ( ")", "U007D" ), ( "~", "U007E" ), ( " ", "U0020" ),
    
    // 全角英字
    ( "ａ", "UFF41" ), ( "ｂ", "UFF42" ), ( "ｃ", "UFF43" ), ( "ｄ", "UFF44" ), ( "ｅ", "UFF45" ),
    ( "ｆ", "UFF46" ), ( "ｇ", "UFF47" ), ( "ｈ", "UFF48" ), ( "ｉ", "UFF49" ), ( "ｊ", "UFF4A" ),
    ( "ｋ", "UFF4B" ), ( "ｌ", "UFF4C" ), ( "ｍ", "UFF4D" ), ( "ｎ", "UFF4E" ), ( "ｏ", "UFF4F" ),
    ( "ｐ", "UFF50" ), ( "ｑ", "UFF51" ), ( "ｒ", "UFF52" ), ( "ｓ", "UFF53" ), ( "ｔ", "UFF54" ),
    ( "ｕ", "UFF55" ), ( "ｖ", "UFF56" ), ( "ｗ", "UFF57" ), ( "ｘ", "UFF58" ), ( "ｙ", "UFF59" ),
    ( "ｚ", "UFF5A" ),

    ( "Ａ", "UFF21" ), ( "Ｂ", "UFF22" ), ( "Ｃ", "UFF23" ), ( "Ｄ", "UFF24" ), ( "Ｅ", "UFF25" ),
    ( "Ｆ", "UFF26" ), ( "Ｇ", "UFF27" ), ( "Ｈ", "UFF28" ), ( "Ｉ", "UFF29" ), ( "Ｊ", "UFF2A" ),
    ( "Ｋ", "UFF2B" ), ( "Ｌ", "UFF2C" ), ( "Ｍ", "UFF2D" ), ( "Ｎ", "UFF2E" ), ( "Ｏ", "UFF2F" ),
    ( "Ｐ", "UFF30" ), ( "Ｑ", "UFF31" ), ( "Ｒ", "UFF32" ), ( "Ｓ", "UFF33" ), ( "Ｔ", "UFF34" ),
    ( "Ｕ", "UFF35" ), ( "Ｖ", "UFF36" ), ( "Ｗ", "UFF37" ), ( "Ｘ", "UFF38" ), ( "Ｙ", "UFF39" ),
    ( "Ｚ", "UFF3A" ),

    ( "１", "UFF11" ), ( "２", "UFF12" ), ( "３", "UFF13" ), ( "４", "UFF14" ), ( "５", "UFF15" ),
    ( "６", "UFF16" ), ( "７", "UFF17" ), ( "８", "UFF18" ), ( "９", "UFF19" ), ( "０", "UFF10" ),

    ( "〜", "U301C" ),
    
    // ラテン文字拡張
    ( "¡", "U00A1" ), ( "¢", "U00A2" ), ( "£", "U00A3" ), ( "¤", "U00A4" ), ( "¥", "U00A5" ),
    ( "¦", "U00A6" ), ( "§", "U00A7" ), ( "¨", "U00A8" ), ( "©", "U00A9" ), ( "ª", "U00AA" ),
    ( "«", "U00AB" ), ( "¬", "U00AC" ), ( "®", "U00AE" ), ( "¯", "U00AF" ), ( "°", "U00B0" ),
    ( "±", "U00B1" ), ( "²", "U00B2" ), ( "³", "U00B3" ), ( "´", "U00B4" ), ( "µ", "U00B5" ),
    ( "¶", "U00B6" ), ( "·", "U00B7" ), ( "¸", "U00B8" ), ( "¹", "U00B9" ), ( "º", "U00BA" ),
    ( "»", "U00BB" ), ( "¼", "U00BC" ), ( "½", "U00BD" ), ( "¾", "U00BE" ), ( "¿", "U00BF" ),

    ( "À", "U00C0" ), ( "Á", "U00C1" ), ( "Â", "U00C2" ), ( "Ã", "U00C3" ), ( "Ä", "U00C4" ),
    ( "Å", "U00C5" ), ( "Æ", "U00C6" ), ( "Ç", "U00C7" ), ( "È", "U00C8" ), ( "É", "U00C9" ),
    ( "Ê", "U00CA" ), ( "Ë", "U00CB" ), ( "Ì", "U00CC" ), ( "Í", "U00CD" ), ( "Î", "U00CE" ),
    ( "Ï", "U00CF" ), ( "Ð", "U00D0" ), ( "Ñ", "U00D1" ), ( "Ò", "U00D2" ), ( "Ó", "U00D3" ),
    ( "Ô", "U00D4" ), ( "Õ", "U00D5" ), ( "Ö", "U00D6" ), ( "×", "U00D7" ), ( "Ø", "U00D8" ),
    ( "Ù", "U00D9" ), ( "Ú", "U00DA" ), ( "Û", "U00DB" ), ( "Ü", "U00DC" ), ( "Ý", "U00DD" ),
    ( "Þ", "U00DE" ), ( "ß", "U00DF" ),

    ( "à", "U00E0" ), ( "á", "U00E1" ), ( "â", "U00E2" ), ( "ã", "U00E3" ), ( "ä", "U00E4" ),
    ( "å", "U00E5" ), ( "æ", "U00E6" ), ( "ç", "U00E7" ), ( "è", "U00E8" ), ( "é", "U00E9" ),
    ( "ê", "U00EA" ), ( "ë", "U00EB" ), ( "ì", "U00EC" ), ( "í", "U00ED" ), ( "î", "U00EE" ),
    ( "ï", "U00EF" ), ( "ð", "U00F0" ), ( "ñ", "U00F1" ), ( "ò", "U00F2" ), ( "ó", "U00F3" ),
    ( "ô", "U00F4" ), ( "õ", "U00F5" ), ( "ö", "U00F6" ), ( "÷", "U00F7" ), ( "ø", "U00F8" ),
    ( "ù", "U00F9" ), ( "ú", "U00FA" ), ( "û", "U00FB" ), ( "ü", "U00FC" ), ( "ý", "U00FD" ),
    ( "þ", "U00FE" ), ( "ÿ", "U00FF" ),
    
    // 一般句読点（重複と不正文字修正済み）
            ( "‒", "U2012" ), ( "–", "U2013" ), ( "—", "U2014" ), ( "―", "U2015" ), ( "‖", "U2016" ),
            ( "‗", "U2017" ), ( "‘", "U2018" ), ( "’", "U2019" ), ( "‚", "U201A" ), ( "‛", "U201B" ),
            ( "\"", "U201C" ), ( "\"_right", "U201D" ), ( "„", "U201E" ), ( "‟", "U201F" ), ( "†", "U2020" ),
            ( "‡", "U2021" ), ( "•", "U2022" ), ( "…", "U2026" ), ( "‪", "U202A" ), ( "‫", "U202B" ),
            ( "‬", "U202C" ), ( "‭", "U202D" ), ( "‮", "U202E" ), ( "‰", "U2030" ), ( "′", "U2032" ),
            ( "″", "U2033" ), ( "‴", "U2034" ), ( "‹", "U2039" ), ( "›", "U203A" ), ( "‼", "U203C" ),
            ( "‾", "U203E" ), ( "⁄", "U2044" ), ( "⁞", "U205E" ), ( "⁪", "U206A" ), ( "⁫", "U206B" ),
            ( "⁬", "U206C" ), ( "⁭", "U206D" ), ( "⁮", "U206E" ), ( "⁯", "U206F" ), ( "€", "U20AC" ),
            ( "™", "U2122" ), ( "□", "U25A1" ), ( "　", "U3000" ),
    
    // 日本語句読点・記号
    ( "、", "U3001" ), ( "。", "U3002" ), ( "，", "UFF0C" ), ( "．", "UFF0E" ), ( "・", "U30FB" ),
    ( "：", "UFF1A" ), ( "；", "UFF1B" ), ( "？", "UFF1F" ), ( "！", "UFF01" ), ( "゛", "U309B" ),
    ( "゜", "U309C" ), ( "´", "U00B4" ), ( "`", "U0060" ), ( "¨", "U00A8" ), ( "＾", "UFF3E" ),
    ( "￣", "UFFE3" ), ( "＿", "UFF3F" ), ( "ヽ", "U30FD" ), ( "ヾ", "U30FE" ), ( "ゝ", "U309D" ),
    ( "ゞ", "U309E" ), ( "〃", "U3003" ), ( "仝", "U4EDD" ), ( "々", "U3005" ), ( "〆", "U3006" ),
    ( "〇", "U3007" ), ( "ー", "U30FC" ), ( "―", "U2015" ), ( "‐", "U2010" ), ( "／", "UFF0F" ),
    
    // 図形記号
    ( "◆", "U25C6" ), ( "□", "U25A1" ), ( "■", "U25A0" ), ( "△", "U25B3" ), ( "▲", "U25B2" ),
    ( "▽", "U25BD" ), ( "▼", "U25BC" ), ( "※", "U203B" ), ( "〒", "U3012" ), ( "→", "U2192" ),
    ( "←", "U2190" ), ( "↑", "U2191" ), ( "↓", "U2193" ), ( "〓", "U3013" ),
    
    // 数学記号
    ( "∈", "U2208" ), ( "∋", "U220B" ), ( "⊆", "U2286" ), ( "⊇", "U2287" ), ( "⊂", "U2282" ),
    ( "⊃", "U2283" ),
    
    // カタカナ（半角）
    ( "ｱ", "UFF71" ), ( "ｲ", "UFF72" ), ( "ｳ", "UFF73" ), ( "ｴ", "UFF74" ), ( "ｵ", "UFF75" ),
    ( "ｶ", "UFF76" ), ( "ｷ", "UFF77" ), ( "ｸ", "UFF78" ), ( "ｹ", "UFF79" ), ( "ｺ", "UFF7A" ),
    ( "ｻ", "UFF7B" ), ( "ｼ", "UFF7C" ), ( "ｽ", "UFF7D" ), ( "ｾ", "UFF7E" ), ( "ｿ", "UFF7F" ),
    ( "ﾀ", "UFF80" ), ( "ﾁ", "UFF81" ), ( "ﾂ", "UFF82" ), ( "ﾃ", "UFF83" ), ( "ﾄ", "UFF84" ),
    ( "ﾅ", "UFF85" ), ( "ﾆ", "UFF86" ), ( "ﾇ", "UFF87" ), ( "ﾈ", "UFF88" ), ( "ﾉ", "UFF89" ),
    ( "ﾊ", "UFF8A" ), ( "ﾋ", "UFF8B" ), ( "ﾌ", "UFF8C" ), ( "ﾍ", "UFF8D" ), ( "ﾎ", "UFF8E" ),
    ( "ﾏ", "UFF8F" ), ( "ﾐ", "UFF90" ), ( "ﾑ", "UFF91" ), ( "ﾒ", "UFF92" ), ( "ﾓ", "UFF93" ),
    ( "ﾔ", "UFF94" ), ( "ﾕ", "UFF95" ), ( "ﾖ", "UFF96" ), ( "ﾗ", "UFF97" ), ( "ﾘ", "UFF98" ),
    ( "ﾙ", "UFF99" ), ( "ﾚ", "UFF9A" ), ( "ﾛ", "UFF9B" ), ( "ﾜ", "UFF9C" ), ( "ｦ", "UFF66" ),
    ( "ﾝ", "UFF9D" ),
    
    // 半角カタカナ小文字・濁音・半濁音
    ( "ｧ", "UFF67" ), ( "ｨ", "UFF68" ), ( "ｩ", "UFF69" ), ( "ｪ", "UFF6A" ), ( "ｫ", "UFF6B" ),
    ( "ｯ", "UFF6F" ), ( "ｬ", "UFF6C" ), ( "ｭ", "UFF6D" ), ( "ｮ", "UFF6E" ), ( "ｰ", "UFF70" ),
    ( "ｶﾞ", "UFF76UFF9E" ), ( "ｷﾞ", "UFF77UFF9E" ), ( "ｸﾞ", "UFF78UFF9E" ), ( "ｹﾞ", "UFF79UFF9E" ),
    ( "ｺﾞ", "UFF7AUFFY9E" ), ( "ｻﾞ", "UFF7BUFF9E" ), ( "ｼﾞ", "UFF7CUFF9E" ), ( "ｽﾞ", "UFF7DUFFY9E" ),
    ( "ｾﾞ", "UFF7EUFF9E" ), ( "ｿﾞ", "UFF7FUFF9E" ), ( "ﾀﾞ", "UFF80UFF9E" ), ( "ﾁﾞ", "UFF81UFF9E" ),
    ( "ﾂﾞ", "UFF82UFF9E" ), ( "ﾃﾞ", "UFF83UFF9E" ), ( "ﾄﾞ", "UFF84UFF9E" ), ( "ﾊﾞ", "UFF8AUFF9E" ),
    ( "ﾋﾞ", "UFF8BUFF9E" ), ( "ﾌﾞ", "UFF8CUFF9E" ), ( "ﾍﾞ", "UFF8DUFF9E" ), ( "ﾎﾞ", "UFF8EUFFY9E" ),
    ( "ﾊﾟ", "UFF8AUFFY9F" ), ( "ﾋﾟ", "UFF8BUFF9F" ), ( "ﾌﾟ", "UFF8CUFF9F" ), ( "ﾍﾟ", "UFF8DUFFY9F" ),
    ( "ﾎﾟ", "UFF8EUFY9F" ), ( "ｳﾞ", "UFF73UFF9E" ),
    
    // ひらがな
    ( "ぁ", "U3041" ), ( "あ", "U3042" ), ( "ぃ", "U3043" ), ( "い", "U3044" ), ( "ぅ", "U3045" ),
    ( "う", "U3046" ), ( "ぇ", "U3047" ), ( "え", "U3048" ), ( "ぉ", "U3049" ), ( "お", "U304A" ),
    ( "か", "U304B" ), ( "が", "U304C" ), ( "き", "U304D" ), ( "ぎ", "U304E" ), ( "く", "U304F" ),
    ( "ぐ", "U3050" ), ( "け", "U3051" ), ( "げ", "U3052" ), ( "こ", "U3053" ), ( "ご", "U3054" ),
    ( "さ", "U3055" ), ( "ざ", "U3056" ), ( "し", "U3057" ), ( "じ", "U3058" ), ( "す", "U3059" ),
    ( "ず", "U305A" ), ( "せ", "U305B" ), ( "ぜ", "U305C" ), ( "そ", "U305D" ), ( "ぞ", "U305E" ),
    ( "た", "U305F" ), ( "だ", "U3060" ), ( "ち", "U3061" ), ( "ぢ", "U3062" ), ( "っ", "U3063" ),
    ( "つ", "U3064" ), ( "づ", "U3065" ), ( "て", "U3066" ), ( "で", "U3067" ), ( "と", "U3068" ),
    ( "ど", "U3069" ), ( "な", "U306A" ), ( "に", "U306B" ), ( "ぬ", "U306C" ), ( "ね", "U306D" ),
    ( "の", "U306E" ), ( "は", "U306F" ), ( "ば", "U3070" ), ( "ぱ", "U3071" ), ( "ひ", "U3072" ),
    ( "び", "U3073" ), ( "ぴ", "U3074" ), ( "ふ", "U3075" ), ( "ぶ", "U3076" ), ( "ぷ", "U3077" ),
    ( "へ", "U3078" ), ( "べ", "U3079" ), ( "ぺ", "U307A" ), ( "ほ", "U307B" ), ( "ぼ", "U307C" ),
    ( "ぽ", "U307D" ), ( "ま", "U307E" ), ( "み", "U307F" ), ( "む", "U3080" ), ( "め", "U3081" ),
    ( "も", "U3082" ), ( "ゃ", "U3083" ), ( "や", "U3084" ), ( "ゅ", "U3085" ), ( "ゆ", "U3086" ),
    ( "ょ", "U3087" ), ( "よ", "U3088" ), ( "ら", "U3089" ), ( "り", "U308A" ), ( "る", "U308B" ),
    ( "れ", "U308C" ), ( "ろ", "U308D" ), ( "ゎ", "U308E" ), ( "わ", "U308F" ), ( "ゐ", "U3090" ),
    ( "ゑ", "U3091" ), ( "を", "U3092" ), ( "ん", "U3093" ),
    
    // カタカナ
    ( "ァ", "U30A1" ), ( "ア", "U30A2" ), ( "ィ", "U30A3" ), ( "イ", "U30A4" ), ( "ゥ", "U30A5" ),
    ( "ウ", "U30A6" ), ( "ェ", "U30A7" ), ( "エ", "U30A8" ), ( "ォ", "U30A9" ), ( "オ", "U30AA" ),
    ( "カ", "U30AB" ), ( "ガ", "U30AC" ), ( "キ", "U30AD" ), ( "ギ", "U30AE" ), ( "ク", "U30AF" ),
    ( "グ", "U30B0" ), ( "ケ", "U30B1" ), ( "ゲ", "U30B2" ), ( "コ", "U30B3" ), ( "ゴ", "U30B4" ),
    ( "サ", "U30B5" ), ( "ザ", "U30B6" ), ( "シ", "U30B7" ), ( "ジ", "U30B8" ), ( "ス", "U30B9" ),
    ( "ズ", "U30BA" ), ( "セ", "U30BB" ), ( "ゼ", "U30BC" ), ( "ソ", "U30BD" ), ( "ゾ", "U30BE" ),
    ( "タ", "U30BF" ), ( "ダ", "U30C0" ), ( "チ", "U30C1" ), ( "ヂ", "U30C2" ), ( "ッ", "U30C3" ),
    ( "ツ", "U30C4" ), ( "ヅ", "U30C5" ), ( "テ", "U30C6" ), ( "デ", "U30C7" ), ( "ト", "U30C8" ),
    ( "ド", "U30C9" ), ( "ナ", "U30CA" ), ( "ニ", "U30CB" ), ( "ヌ", "U30CC" ), ( "ネ", "U30CD" ),
    ( "ノ", "U30CE" ), ( "ハ", "U30CF" ), ( "バ", "U30D0" ), ( "パ", "U30D1" ), ( "ヒ", "U30D2" ),
    ( "ビ", "U30D3" ), ( "ピ", "U30D4" ), ( "フ", "U30D5" ), ( "ブ", "U30D6" ), ( "プ", "U30D7" ),
    ( "ヘ", "U30D8" ), ( "ベ", "U30D9" ), ( "ペ", "U30DA" ), ( "ホ", "U30DB" ), ( "ボ", "U30DC" ),
    ( "ポ", "U30DD" ), ( "マ", "U30DE" ), ( "ミ", "U30DF" ), ( "ム", "U30E0" ), ( "メ", "U30E1" ),
    ( "モ", "U30E2" ), ( "ャ", "U30E3" ), ( "ヤ", "U30E4" ), ( "ュ", "U30E5" ), ( "ユ", "U30E6" ),
    ( "ョ", "U30E7" ), ( "ヨ", "U30E8" ), ( "ラ", "U30E9" ), ( "リ", "U30EA" ), ( "ル", "U30EB" ),
    ( "レ", "U30EC" ), ( "ロ", "U30ED" ), ( "ヮ", "U30EE" ), ( "ワ", "U30EF" ), ( "ヰ", "U30F0" ),
    ( "ヱ", "U30F1" ), ( "ヲ", "U30F2" ), ( "ン", "U30F3" ), ( "ヴ", "U30F4" ), ( "ヵ", "U30F5" ),
    ( "ヶ", "U30F6" ),
    
    // ギリシャ文字
( "Α", "U0391" ), ( "Β", "U0392" ), ( "Γ", "U0393" ), ( "Δ", "U0394" ), ( "Ε", "U0395" ),
( "Ζ", "U0396" ), ( "Η", "U0397" ), ( "Θ", "U0398" ), ( "Ι", "U0399" ), ( "Κ", "U039A" ),
( "Λ", "U039B" ), ( "Μ", "U039C" ), ( "Ν", "U039D" ), ( "Ξ", "U039E" ), ( "Ο", "U039F" ),
( "Π", "U03A0" ), ( "Ρ", "U03A1" ), ( "Σ", "U03A3" ), ( "Τ", "U03A4" )
            };

            var dict = new Dictionary<string, string>();
            foreach (var entry in entries)
            {
                if (!dict.ContainsKey(entry.Item1))
                {
                    dict.Add(entry.Item1, entry.Item2);
                }
                else
                {
                    // Debug.LogWarning($"重複キーをスキップ: {entry.Item1}");
                }
            }
            charToPrefabName = dict;
        }
    }
}
